Tekla Open API Reference for Tekla Structures 2025
DataFilterExpression.ToString Method
 Creates a string representation of the current object.
 Namespace: Tekla.Structures.Filtering
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
A new string representing the current object.
See Also
Reference
DataFilterExpression Class
Tekla.Structures.Filtering Namespace